Documents/СводноеНачисление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>СводноеНачисление</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>флОбменДанными</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>тчДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ППК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ППК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПлатежки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСписания</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС14</Name>
					<Comment>(Общ) Ставка НДС 14%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРеализацияТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаКомиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПередачиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыПередачиТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<Comment>(Общ) Реализация со склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрдеру</Name>
					<Comment>(Упр) Поступление по приходному ордеру</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиПодключенияКБилингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияКБилингу</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресRestAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортRestAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПакетаДляПолученияДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМетодДляОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТипыОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеЭквайрера</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Эквайрер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорЭквайринга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыЭквайринга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>slug</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоответвиеМетодовИНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СхемаРеализации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СхемыРеализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/СводноеНачисление/Ext/ObjectModule.bsl
Перем мВалютаРегламентированногоУчета Экспорт;

Процедура СоздатьНачисления(Организация, флОбменДанным = Ложь) Экспорт
	
	Организация = Справочники.Организации.НайтиПоНаименованию("VechirTelecom (упр.)");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводноеНачислениетчДанные.ППК КАК ППК,
		|	СводноеНачислениетчДанные.ППК.Владелец КАК ДоговорКонтрагента,
		|	СводноеНачислениетчДанные.ППК.Контрагент КАК Контрагент,
		|	СводноеНачислениетчДанные.СуммаОплаты КАК Сумма,
		|	СводноеНачислениетчДанные.СуммаОплаты КАК Цена,
		|	СводноеНачислениетчДанные.СуммаОплаты КАК СуммаПлатежа,
		|	СводноеНачислениетчДанные.СуммаОплаты КАК СуммаВзаиморасчетов,
		|	СводноеНачислениетчДанные.Ссылка.Организация КАК Организация,
		|	&Валюта КАК ВалютаДокумента,
		|	1 КАК Количество,
		|	&СтавкаНДС КАК СтавкаНДС,
		|	&ВидОперации КАК ВидОперации,
		|	&ВидПередачи,
		|	&КурсВзаиморасчетов,
		|	&КратностьВзаиморасчетов,
		|	&СчетУчетаРасчетовСКонтрагентом,
		|	&СчетРасчетовНдс КАК СчетУчетаНДС,
		|	&СчетУчетаНДСПодтвержденный,
		|	&СчетУчетаРасчетовСКонтрагентом КАК СчетУчетаРасчетовСКонтрагентом1,
		|	&СчетУчетаРасчетовПоАвансам,
		|	НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.СхемаРеализации,
		|	&Склад,
		|	&Организация КАК Организация1,
		|	СводноеНачислениетчДанные.ДатаПлатежки,
		|	НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.Номенклатура КАК Номенклатура,
		|	НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.Номенклатура КАК Содержание,
		|	СводноеНачислениетчДанные.ID
		|ИЗ
		|	Документ.СводноеНачисление.тчДанные КАК СводноеНачислениетчДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НастройкиПодключенияКБилингу.СоответвиеМетодовИНоменклатуры КАК НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры
		|		ПО СводноеНачислениетчДанные.Метод = НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.Метод
		|ГДЕ
		|	СводноеНачислениетчДанные.Ссылка = &Ссылка
		|	И СводноеНачислениетчДанные.ДокументОплаты = ЗНАЧЕНИЕ(Документ.РеализациятоваровУслуг.ПустаяСсылка)
		|	И НастройкиПодключенияКБилингуСоответвиеМетодовИНоменклатуры.Ссылка.Логин = &Логин";
	
	Запрос.УстановитьПараметр("Логин", "i.novash");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Валюта", мВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("СтавкаНДС", Перечисления.СтавкиНДС.БезНДС);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия);
	Запрос.УстановитьПараметр("ВидПередачи", Перечисления.ВидыПередачиТоваров.СоСклада);
	Запрос.УстановитьПараметр("КурсВзаиморасчетов", 1);
	Запрос.УстановитьПараметр("КратностьВзаиморасчетов", 1);
	Запрос.УстановитьПараметр("СчетРасчетов", ПланыСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте);//333
	Запрос.УстановитьПараметр("СчетРасчетовНдс", ПланыСчетов.Хозрасчетный.НалоговыеОбязательстваНеподтвержденные);//6432
	Запрос.УстановитьПараметр("СчетУчетаНДСПодтвержденный", ПланыСчетов.Хозрасчетный.НалоговыеОбязательства);//6431
	Запрос.УстановитьПараметр("СчетУчетаРасчетовСКонтрагентом", ПланыСчетов.Хозрасчетный.ВзаиморасчетыСАбонентами);//3611
	Запрос.УстановитьПараметр("СчетУчетаРасчетовПоАвансам", ПланыСчетов.Хозрасчетный.ВзаиморасчетыСАбонентами);//361
	Запрос.УстановитьПараметр("СхемаРеализации", Справочники.СхемыРеализации.Услуги);
	Запрос.УстановитьПараметр("Склад", Справочники.Склады.НайтиПоКоду("000000001"));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
	сч = 0;
	счДок = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		сч = сч + 1;
		
		ДокОб 								= Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДокОб.ОбменДанными.Загрузка			= флОбменДанным;
		ДокОб.Дата 							= Дата;
		ДокОб.Ответственный 				= Ответственный;
		ДокОб.ДокументОснование				= Ссылка;
		ДокОб.ОтражатьВУправленческомУчете 	= Истина;
		ДокОб.ОтражатьВБухгалтерскомУчете 	= Истина;
		
		ДокОб.Комментарий = "#Создано автоматический";
		
		ЗаполнитьЗначенияСвойств(ДокОб, ВыборкаДетальныеЗаписи);
		
		НовСтр = ДокОб.Услуги.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ВыборкаДетальныеЗаписи);
		
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение);
			Если счДок >100 Тогда
				Записать();
				счДок = 0;
			КонецЕсли;
			счДок = счДок+1;
		Исключение
			Сообщить(ОписаниеОшибки());
			сч = сч -1;
			Продолжить;
		КонецПопытки;
		СтрПоиска = Новый Структура;
		СтрПоиска.Вставить("ППК", ВыборкаДетальныеЗаписи.ППК);
		СтрПоиска.Вставить("СуммаОплаты", ВыборкаДетальныеЗаписи.СуммаПлатежа);
		СтрПоиска.Вставить("ID", ВыборкаДетальныеЗаписи.ID);
		
		
		НайденныеСтроки = тчДанные.НайтиСтроки(СтрПоиска);
		НайденныеСтроки[0].ДокументОплаты = ДокОб.Ссылка;
		
	КонецЦикла;
		
	Записать();
	
	Сообщить(НСТР("ru='Создано " + сч+ " " + "документов'; uk = 'Створено " + сч+ " " + "докумнтів""'"));
	
КонецПроцедуры

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета")
